Return.xml

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">    <s:Header>        <Action xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none" s:mustUnderstand="1">localhost:8080/kestrel/AirService</Action>    </s:Header>    <s:Body xmlns:xsd="http://www.w3.org/2001/xmlschema" xmlns:xsi="http://www.w3.org/2001/xmlschema-instance">        <LowFareSearchReq xmlns="http://www.travelport.com/schema/air_v41_0" SolutionResult="true" AuthorizedBy="user" TraceId="394d96c00971c4545315e49584609ff6" TargetBranch="P7106193">            <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v41_0" OriginApplication="UAPI" />            <SearchAirLeg>    <SearchOrigin>        <CityOrAirport xmlns="http://www.travelport.com/schema/common_v41_0" Code="LON" />    </SearchOrigin>    <SearchDestination>        <CityOrAirport xmlns="http://www.travelport.com/schema/common_v41_0" Code="DXB" />    </SearchDestination>    <SearchDepTime PreferredTime="2020-12-02T00:00:00" />    <AirLegModifiers>        <PermittedCabins>            <CabinClass xmlns="http://www.travelport.com/schema/common_v41_0" Type="Economy" />        </PermittedCabins>    </AirLegModifiers></SearchAirLeg><SearchAirLeg>    <SearchOrigin>        <CityOrAirport xmlns="http://www.travelport.com/schema/common_v41_0" Code="DXB" />    </SearchOrigin>    <SearchDestination>        <CityOrAirport xmlns="http://www.travelport.com/schema/common_v41_0" Code="LON" />    </SearchDestination>    <SearchDepTime PreferredTime="2020-12-10T00:00:00" />    <AirLegModifiers>        <PermittedCabins>            <CabinClass xmlns="http://www.travelport.com/schema/common_v41_0" Type="Economy" />        </PermittedCabins>    </AirLegModifiers></SearchAirLeg>            <AirSearchModifiers MaxSolutions="200">            <PreferredProviders>                <Provider xmlns="http://www.travelport.com/schema/common_v41_0" Code="1G" />            </PreferredProviders>            </AirSearchModifiers>            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v41_0" Code="ADT" />        </LowFareSearchReq>    </s:Body></s:Envelope>